Дошкольное_учреждение83/src/Documents/удуПриказОВыбытииИзГруппы/удуПриказОВыбытииИзГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуПриказОВыбытииИзГруппы</name>
  <registerRecords>InformationRegister.удуСведенияОЗачисленииРебенкаВГруппу</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВыбытия</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыбытияПоУмолчанию</name>
    <type>
      <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоВыбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьВоспитанники</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВыбытия</name>
      <type>
        <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеЗачисленияВГруппу</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Documents/удуПриказОЗачисленииРебенкаВГруппу/удуПриказОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуПриказОЗачисленииРебенкаВГруппу</name>
  <registerRecords>InformationRegister.удуСведенияОЗачисленииРебенкаВГруппу</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольВместимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКомплектация</name>
    <type>
      <types>DocumentRef.удуКомплектованиеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗачисление</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеЗачисления</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Documents/удуПриказОПереводеВДругуюГруппу/удуПриказОПереводеВДругуюГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуПриказОПереводеВДругуюГруппу</name>
  <registerRecords>InformationRegister.удуСведенияОЗачисленииРебенкаВГруппу</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПервоначальная</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляПеревода</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольВместимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПереводВГруппуБезДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКомплектация</name>
    <type>
      <types>DocumentRef.удуКомплектованиеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьВоспитанники</name>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущееОснованиеЗачисления</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеОснованиеЗачисления</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Catalogs/удуДети/удуДети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуДети</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтатусРебенка</name>
    <type>
      <types>EnumRef.удуСтатусРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.удуПол</types>
    </type>
  </attributes>
  <attributes>
    <name>Национальность</name>
    <type>
      <types>CatalogRef.удуНациональности</types>
    </type>
  </attributes>
  <attributes>
    <name>РоднойЯзык</name>
    <type>
      <types>CatalogRef.удуЯзыкиНародовМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиСвидетельства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдачиСвидетельства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаРождения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаПроживания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоциальноеПоложение</name>
    <type>
      <types>CatalogRef.удуСоциальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖилищныеУсловия</name>
    <type>
      <types>CatalogRef.удуЖилищныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериальноеПоложение</name>
    <type>
      <types>CatalogRef.удуМатериальныеПоложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСоциальныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотографияРебенка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Documents/удуПриказОВыбытииИзГруппы/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ОбработатьПолученныеСведенияНаСервере(ПереданныйПараметр)
	ПолученнаяТаблица = ДанныеФормыВЗначение(ПереданныйПараметр, Тип("ТаблицаЗначений"));
	
	ОбъектРеквизит = РеквизитФормыВЗначение("Объект");
	
	Для Каждого ПолученнаяСтрока Из ПолученнаяТаблица Цикл
		Если ПолученнаяСтрока.Обрабатывать Тогда
			НоваяСтрокаВоспитанника = ОбъектРеквизит.ТабличнаяЧастьВоспитанники.Добавить();
			НоваяСтрокаВоспитанника.Ребенок = ПолученнаяСтрока.Ребенок;
			НоваяСтрокаВоспитанника.ОснованиеЗачисленияВГруппу = ПолученнаяСтрока.ОснованиеЗачисления;
			НоваяСтрокаВоспитанника.ПричинаВыбытия = Объект.ПричинаВыбытияПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбъектРеквизит, "Объект");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПричинуВыбытияНаСервере()
	ОбъектРеквизит = РеквизитФормыВЗначение("Объект");
	
	Для Каждого СтрокаВоспитанник Из ОбъектРеквизит.ТабличнаяЧастьВоспитанники Цикл
		СтрокаВоспитанник.ПричинаВыбытия = Объект.ПричинаВыбытияПоУмолчанию;
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(ОбъектРеквизит, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОСоставеГруппы()
	// Отбор по учреждению
	сэРезультатВыполнения = удуОбработкаПросмотрИнформации.ПолучитьсоставГруппы(Объект.ГруппаВыбытия, ТекущаяДата());		
	ЗначениеВРеквизитФормы(сэРезультатВыполнения, "СоставВыбраннойГруппы");
	
	Если Объект.ГруппаВыбытия.БезОграниченияВместительности Тогда
		Элементы.НадписьСведенияОГруппе.Заголовок = "Количество детей в выбранной группе: " + Строка(сэРезультатВыполнения.Количество()) + ". Вместительность группы не ограничена.";
	Иначе
		Элементы.НадписьСведенияОГруппе.Заголовок = "Количество детей в выбранной группе: " + Строка(сэРезультатВыполнения.Количество()) + ". Вместительность группы: " + Строка(Объект.ГруппаВыбытия.Вместительность);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КомандаЗаполнитьПричинуВыбытия(Команда)
	// Вставить содержимое обработчика.
	Если Объект.ТабличнаяЧастьВоспитанники.Количество() > 0 Тогда
		Если Вопрос("Заполнить причину выбытия значением по умолчанию?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЗаполнитьПричинуВыбытияНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьТабличнуюЧасть(Команда)
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗаполнено(Объект.ГруппаВыбытия) Тогда
		Вопрос("Перед заполнением табличной части сначала укажите группу", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
	
	Если Объект.ТабличнаяЧастьВоспитанники.Количество() > 0 Тогда
		Если Вопрос("Перед заполнением табличная часть будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Объект.ТабличнаяЧастьВоспитанники.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ФормаЗаполнения = ПолучитьФорму("Документ.удуПриказОВыбытииИзГруппы.Форма.ФормаЗаполненияДетьми");	
	ФормаЗаполнения.ВладелецФормы = ЭтаФорма;
	ФормаЗаполнения.ПараметрГруппа = Объект.ГруппаВыбытия;
	ФормаЗаполнения.ПараметрДата = Объект.ДатаФактическогоВыбытия;
	ФормаЗаполнения.ОткрытьМодально();	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаВыбытияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСведенияОСоставеГруппы();
КонецПроцедуры

&НаКлиенте
Процедура НадписьСведенияОГруппеНажатие(Элемент)
	// Вставить содержимое обработчика.
	Если СоставВыбраннойГруппы.Количество() > 0 Тогда 
		ФормаПросмотра = ПолучитьФорму("ОбщаяФорма.удуФормаПросмотраСоставаГруппы");
		ФормаПросмотра.ВладелецФормы = ЭтаФорма;
		Для Каждого СтрокаСоставГруппы Из СоставВыбраннойГруппы Цикл
			НоваяСтрокаФормыПросмотра = ФормаПросмотра.ТабличнаяЧастьДети.Добавить();
			НоваяСтрокаФормыПросмотра.Ребенок = СтрокаСоставГруппы.Ребенок;
			НоваяСтрокаФормыПросмотра.Пол = СтрокаСоставГруппы.Пол;
			НоваяСтрокаФормыПросмотра.ДатаРождения = СтрокаСоставГруппы.ДатаРождения;
		КонецЦикла;
		ФормаПросмотра.ОткрытьМодально();		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Учреждение) Тогда
		Объект.Учреждение = Константы.удуОсновноеУчреждение.Получить();
		Если Не ЗначениеЗаполнено(Объект.Учреждение) Тогда
			ЭтаФорма.Элементы.Учреждение.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаФактическогоВыбытия) Тогда
		Объект.ДатаФактическогоВыбытия = ТекущаяДата();
	КонецЕсли;
	
	ОбновитьСведенияОСоставеГруппы();
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДанныеФормыКоллекция") Тогда
		ОбработатьПолученныеСведенияНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаНомерДата.ТолькоПросмотр = Объект.Проведен;
	Элементы.ТабличнаяЧастьВоспитанники.ТолькоПросмотр = Объект.Проведен;
	Элементы.ГруппаВыбытия.ТолькоПросмотр = Объект.Проведен;
	Элементы.ПричинаВыбытияПоУмолчанию.ТолькоПросмотр = Объект.Проведен;	
	Элементы.КнопкаЗаполнитьПричинуВыбытия.Доступность = Не Объект.Проведен;	
	Элементы.КнопкаЗаполнитьТабличнуюЧасть.Доступность = Не Объект.Проведен;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьВоспитанникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если Поле.Имя = "ТабличнаяЧастьВоспитанникиРебенок" Тогда
		СтандартнаяОбработка = Ложь;
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ребенок);
		ОткрытьФормуМодально("Справочник.удуДети.Форма.ФормаЭлемента", ПередаваемыеПараметры, ЭтаФорма);
	ИначеЕсли (Поле.Имя = "ТабличнаяЧастьВоспитанникиОснованиеЗачисленияВГруппу") Тогда
		СтандартнаяОбработка = Ложь;
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.ОснованиеЗачисленияВГруппу);
		Если ТипЗнч(Элемент.ТекущиеДанные.ОснованиеЗачисленияВГруппу) = Тип("ДокументСсылка.удуПриказОЗачисленииРебенкаВГруппу") Тогда
			ОткрытьФормуМодально("Документ.удуПриказОЗачисленииРебенкаВГруппу.Форма.ФормаДокумента", ПередаваемыеПараметры, ЭтаФорма);		
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.ОснованиеЗачисленияВГруппу) = Тип("ДокументСсылка.удуПриказОПереводеВДругуюГруппу") Тогда
			ОткрытьФормуМодально("Документ.удуПриказОПереводеВДругуюГруппу.Форма.ФормаДокумента", ПередаваемыеПараметры, ЭтаФорма);		
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
